export interface TrainingItem {
  id: string;
  "Позначка часу": string; // ISO date string або довільний текстовий формат дати
  "Електронна адреса": string;
  "Працівник, який пройшов курсову підготовку": string;
  "Назва курсів, семінару, вебінару тощо": string;
  "Кількість годин": string; // можливо number, якщо потрібна арифметика
  "З них з інклюзії": string; // можливо number
  "З них з надання психологічної підтримки учасникам освітнього процесу": string; // можливо number
  "Тип документа": string;
  "Номер документа (якщо номера немає, вкажіть \"бн\" без лапок)": string;
  "Дата видачі документа": string;
  "Назва організації чи платформи, на базі якої проходила підготовка, навчання": string;
  "Форма навчання": string;
  "Фотокопія сертифікату, свідоцтва тощо": string; // URL
  "Програма курсів, заходу": string;
  "Потребує зарахування рішенням педради": string; // "Так" | "Ні"
  "Рішення педради про зарахування": string;
  "Рік атестації": string;
  "17.03.2025 р., № 3": string;
  "10.01.2024 р., № 3": string;
  "Покликання на редагування": string; // JSON string
}


export interface DataObject {
  id: string;
  [key: string]: string;
}