export const PAGE_TABLE_1 = '1F6QVr9WNio-_ODmnIlMTSHeSQxLOjgnd0nYB1_z0BeI';
export const PAGE_TABLE_2 = '12tqoeJpUs1qa9paI7YuMpZ17nynq44-qqmn0zgoEup4';

export const REASONS = [
  { title: 'Лікарняний', label: 'ТН' },
  { title: 'Відпустка основна', label: '' },
  { title: 'Відпустка по пологам', label: 'ВП' },
  { title: 'Відпустка без збереження', label: 'НА' },
];

export const COURSES_TABLE_COLLS = [
  { field: 'Позначка часу', title: 'Уведено' },
  { field: 'Електронна адреса', title: 'Email' },
  { field: 'Працівник, який пройшов курсову підготовку', title: 'ПІБ' },
  { field: 'Назва курсів, семінару, вебінару тощо', title: 'Тема' },
  { field: 'Кількість годин', title: 'Всього годин' },
  { field: 'З них з інклюзії', title: 'з інклюзії' },
  {
    field: 'З них з надання психологічної підтримки учасникам освітнього процесу',
    title: 'з надання психологічної підтримки',
  },
  { field: 'Тип документа', title: 'Тип документа' },
  {
    field: 'Номер документа (якщо номера немає, вкажіть "бн" без лапок)',
    title: 'Номер',
  },
  { field: 'Дата видачі документа', title: 'Дата документу' },
  {
    field: 'Назва організації чи платформи, на базі якої проходила підготовка, навчання',
    title: "Суб'єкт підвищення",
  },
  { field: 'Форма навчання', title: '' },
  { field: 'Фотокопія сертифікату, свідоцтва тощо', title: 'Документ' },
  { field: 'Програма курсів, заходу', title: 'Програма' },
  {
    field: 'Потребує зарахування рішенням педради',
    title: 'Потреба в зарахуванні',
  },
  { field: 'Рішення педради про зарахування', title: 'Педрада' },
  { field: 'Рік атестації', title: 'Рік атестації' },
];
